---
kind: property
id: P:Autodesk.Revit.DB.LineSegment.EndPoint
source: html/fa84492f-aaea-004c-2443-d02b6ca83c1d.htm
---
# Autodesk.Revit.DB.LineSegment.EndPoint Property

End point of the line segment.

## Syntax (C#)
```csharp
public XYZ EndPoint { get; }
```